## Terraform Plan (READY) - dev

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_resource_policy.opensearch_logs will be created
  + resource "aws_cloudwatch_log_resource_policy" "opensearch_logs" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "AllowOpenSearchLogs"
      + region          = "ap-northeast-1"
    }

  # module.mod_opensearch_domain.aws_opensearch_domain.this will be created
  + resource "aws_opensearch_domain" "this" {
      + access_policies                   = (known after apply)
      + advanced_options                  = (known after apply)
      + arn                               = (known after apply)
      + dashboard_endpoint                = (known after apply)
      + dashboard_endpoint_v2             = (known after apply)
      + domain_endpoint_v2_hosted_zone_id = (known after apply)
      + domain_id                         = (known after apply)
      + domain_name                       = "dev-opensearch"
      + endpoint                          = (known after apply)
      + endpoint_v2                       = (known after apply)
      + engine_version                    = (known after apply)
      + id                                = (known after apply)
      + ip_address_type                   = (known after apply)
      + region                            = "ap-northeast-1"
      + tags_all                          = (known after apply)

      + cluster_config {
          + dedicated_master_count   = 3
          + dedicated_master_enabled = true
          + dedicated_master_type    = "t3.small.search"
          + instance_count           = 3
          + instance_type            = "r5.large.search"
          + zone_awareness_enabled   = true

          + zone_awareness_config {
              + availability_zone_count = 3
            }
        }

      + ebs_options {
          + ebs_enabled = true
          + iops        = (known after apply)
          + throughput  = (known after apply)
          + volume_size = 10
          + volume_type = "gp3"
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "INDEX_SLOW_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "SEARCH_SLOW_LOGS"
        }

      + snapshot_options {
          + automated_snapshot_start_hour = 3
        }

      + vpc_options {
          + availability_zones = (known after apply)
          + security_group_ids = [
              + "sg-0b684cd1e5998f4e1",
            ]
          + subnet_ids         = [
              + "subnet-0e5d49ba906d3edbd",
              + "subnet-0ecb846ae194cb51a",
              + "subnet-0f00006a31cd38197",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.mod_opensearch_index_slow_log.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/opensearch/dev-opensearch/index-slow"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = (known after apply)
    }

  # module.mod_opensearch_search_slow_log.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/opensearch/dev-opensearch/search-slow"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "opensearch" but a value
was found in file "dev.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_region" but a value
was found in file "dev.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 1 other variable(s) defined
without being declared.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

**Note**: Please review the plan carefully before approving merge.
**Actions**: Once approved and merged to main, the apply workflow will execute automatically.
